AuditLogs
| where TimeGenerated > ago(1d)//Change based on look back
| where Category == "ApplicationManagement"
| where OperationName == "Update application – Certificates and secrets management "
| where Result == "success" //can filter to failed if needed
| extend UserPrincipalName = InitiatedBy.user.userPrincipalName
| extend IPAddress = InitiatedBy.user.ipAddress
| extend AppDisplayName = TargetResources[0].displayName
| extend UserAgent = AdditionalDetails[0].value
| project TimeGenerated, UserPrincipalName, OperationName, IPAddress, AppDisplayName, UserAgent
