AuditLogs
| where OperationName == "Update application"
| extend UpdatedPermission = tostring(parse_json(tostring(parse_json(tostring(TargetResources[0].modifiedProperties))[1].newValue)))
| extend AppName = tostring(TargetResources[0].displayName)
| extend User = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| extend AppId = tostring(AdditionalDetails[1].value)
| project CorrelationId = tostring(parse_json(tostring(TargetResources[0])).correlationId), TimeGenerated, UpdatedPermission, AppName, AppId, User
| summarize max(TimeGenerated) by CorrelationId, UpdatedPermission, AppName, AppId, User
| project CorrelationId, UpdatedPermission, AppName, AppId, User
